<?php
// ==========================================================
// database.php
// ==========================================================
// このファイルは、データベース接続処理を共通化するためのファイルです。
// ==========================================================

require_once __DIR__ . '/common.php';

// ----------------------------------------------------------
// DB接続を返す関数
// ----------------------------------------------------------
function get_database_connection()
{
    $app = $GLOBALS['app'];

    // ------------------------------------------------------
    // DSN作成
    // ------------------------------------------------------
    $dsn =
        'mysql:host=' . $app['db_host'] .
        ';port=' . $app['db_port'] .
        ';dbname=' . $app['db_name'] .
        ';charset=' . $app['db_charset'];

    // ------------------------------------------------------
    // PDO接続作成
    // ------------------------------------------------------
    $database_connection = new PDO(
        $dsn,
        $app['db_user'],
        $app['db_password'],
        [
            PDO::ATTR_ERRMODE => PDO::ERRMODE_EXCEPTION,
            PDO::ATTR_DEFAULT_FETCH_MODE => PDO::FETCH_ASSOC
        ]
    );

    return $database_connection;
}